# -*- coding: utf-8 -*-
"""
Базаа данных на основе словарей

Авторы: Лысыченко Е., Короткова А., Боровенская У.
"""
import pickle as pic
def Base(): 
    """База данных 
    База данных
    Авторы: Лысыченко Е., Короткова А., Боровенская У.
    """
    fields = [ "Вид", "Класс", "Продолжительность жизни", "Питание", "Есть ли в красной книге", "Место обитания"] 
    names = [ "CAP", "ORA", "WAL", "HED", "KRY", "SEA", "BEA", "CAM", "MAN", "PEA", "PEN", "IBI","SWA", "RAV", "MAC", "OGA", "GAV", "CAI", "IGU", "PYT", "BOA", "ALL", "POR", "TOG","ELE", "ZEB", "TIG", "SLO", "OST", "BAR"] 
    CAP = ["Капибара", "Млекопитающие", '12', "Травоядное", "Нет", "Америка"]
    ORA = ["Орангутан", "Млекопитающие","45", "Всеядное", "Да", "Азия"]
    WAL = ["Валлаби Беннета", "Млекопитающие", "10", "Травоядное", "Нет", "Австралия"]
    HED = ["Обыкновенный ёж", "Млекопитающие", "6", "Хищник", "Нет", "Евразия"]
    KRY = [ "Нильский крылан", "Млекопитающие", "20", "Травоядное", "Нет", "Африка"]
    SEA = ["Серый тюлень",  "Млекопитающие", "35", "Хищник", "Да", "Антарктида"]
    BEA = [ "Гималайский медведь", "Млекопитающие", "30", "Всеядное", "Да", "Азия"]
    CAM = [ "Двугорбый верблюд", "Млекопитающие", "50", "Травоядное", "Да", "Азия"]
    MAN = [ "Манул", "Млекопитающие","18", "Хищник", "Да", "Азия"]
    PEA = ["Обыкновенный павлин", "Птицы", "20", "Всеядное", "Нет", "Азия"]
    PEN = ["Южноафриканский пигвин", "Птицы", "12", "Хищник", "Да", "Африка"]
    IBI = [ "Красный ибис", "Птицы",  "20", "Хищник", "Нет", "Америка"]
    SWA = [ "Лебедь-шипун", "Птицы", "20", "Травоядное", "Да", "Евразия"]
    RAV = ["Ворон", "Птицы", "3", "Всеядное", "Нет", "Евразия, Америка"]
    MAC = ["Красный ара", "Птицы", "80", "Всеядное", "Нет", "Америка"]
    OGA = ["Южноафриканский огарь", "Птицы", "20", "Всеядное", "Нет", "Африка"]
    GAV = ["Гавиаловый крокодил", "Рептилии",  "50", "Хищник", "Да", "Азия"]
    CAI = [ "Черный кайман", "Рептилии",  "50", "Хищник", "Да", "Америка"]
    IGU = ["Обыкновенная игуана", "Рептилии",  "8", "Травоядное", "Нет", " Америка"]
    PYT = ["Сетчатый питон", "Рептилии",  "20", "Хищник", "Нет", "Азия"]
    BOA = ["Обыкновенный удав", "Рептилии",  "20", "Хищник", "Нет", "Америка"]
    ALL = ["Миссисипский аллигатор", "Рептилии",  "80", "Хищник", "Да", "Америка"]
    POR = ["Индийский дикобраз", "Млекопитающие", "20", "Травоядное", "Нет", "Азия"]
    TOG = ["Японский макак", "Млекопитающие", "30", "Всеядное", "Нет", "Азия"]
    ELE = ["Азиатский слон", "Млекопитающие",  "80", "Травоядное", "Да", "Азия"]
    ZEB = ["Зебра Греви", "Млекопитающие",  "30", "Травоядное", "Нет", "Африка"]
    TIG = ["Амурский тигр", "Млекопитающие",  "25", "Хищник", "Да", "Евразия"]
    SLO = ["Двупалый ленивец", "Млекопитающие",  "30", "Травоядное", "Да", "Америка"]
    OST = ["Африканский страус", "Птицы",  "40", "Всеядное", "Нет", "Африка"]
    BAR = ["Обыкновенная сипуха", "Птицы", "18", "Хищник", "Да", "Америка"]
    
    a1 = [ CAP, ORA, WAL, HED, KRY, SEA, BEA, CAM, MAN, PEA, PEN, IBI, SWA, RAV, MAC, OGA, GAV, CAI, IGU, PYT, BOA, ALL, POR, TOG,ELE, ZEB, TIG, SLO, OST, BAR ]
    
    a2 = [dict(zip(fields,x)) for x in a1]
    
    a3 = dict(zip(names,a2))
    
    return a3

q=Base()


fl1=open("../data/txt.txt","wb")
pic.dump(q,fl1)
fl1.close()
   



   




